simonmorley/Arduino/hardware/arduino/samd/boards.txt
#ARDUINO ZERO PRO (WITH) BOOTLOADER - PROGRAMMING PORT
arduino_zero_pro_bl_dbg.name=Arduino Zero Pro (Programming Port)
arduino_zero_pro_bl_dbg.vid.0=0x03eb
arduino_zero_pro_bl_dbg.pid.0=0x2111
arduino_zero_pro_bl_dbg.upload.tool=openocd
arduino_zero_pro_bl_dbg.upload.protocol=sam-ba
arduino_zero_pro_bl_dbg.upload.maximum_size=262144
arduino_zero_pro_bl_dbg.upload.use_1200bps_touch=false
arduino_zero_pro_bl_dbg.upload.wait_for_upload_port=false
arduino_zero_pro_bl_dbg.upload.native_usb=false
arduino_zero_pro_bl_dbg.build.mcu=cortex-m0plus
arduino_zero_pro_bl_dbg.build.f_cpu=48000000L
arduino_zero_pro_bl_dbg.build.usb_product="Arduino Zero"
arduino_zero_pro_bl_dbg.build.board=SAM_ZERO
arduino_zero_pro_bl_dbg.build.core=arduino
arduino_zero_pro_bl_dbg.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero_pro_bl_dbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_pro_bl_dbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_pro_bl_dbg.build.variant=arduino_zero
arduino_zero_pro_bl_dbg.build.variant_system_lib=
arduino_zero_pro_bl_dbg.build.vid=0x2a03
arduino_zero_pro_bl_dbg.build.pid=0x804d
arduino_zero_pro_bl_dbg.build.section.start=0x4000

#ARDUINO ZERO PRO (WITH) BOOTLOADER - NATIVE PORT
arduino_zero_pro_bl.name=Arduino Zero Pro (Native USB Port)
arduino_zero_pro_bl.vid.0=0x2a03
arduino_zero_pro_bl.pid.0=0x004d
arduino_zero_pro_bl.vid.1=0x2a03
arduino_zero_pro_bl.pid.1=0x804d
arduino_zero_pro_bl.upload.tool=avrdude
arduino_zero_pro_bl.upload.protocol=stk500v2
arduino_zero_pro_bl.upload.maximum_size=262144
arduino_zero_pro_bl.upload.use_1200bps_touch=true
arduino_zero_pro_bl.upload.wait_for_upload_port=true
arduino_zero_pro_bl.upload.native_usb=true
arduino_zero_pro_bl.upload.speed=57600
arduino_zero_pro_bl.build.mcu=cortex-m0plus
arduino_zero_pro_bl.build.f_cpu=48000000L
arduino_zero_pro_bl.build.usb_product="Arduino Zero"
arduino_zero_pro_bl.build.board=SAM_ZERO
arduino_zero_pro_bl.build.core=arduino
arduino_zero_pro_bl.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero_pro_bl.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_pro_bl.build.variant=arduino_zero
arduino_zero_pro_bl.build.variant_system_lib=
arduino_zero_pro_bl.build.vid=0x2a03
arduino_zero_pro_bl.build.pid=0x804d
arduino_zero_pro_bl.build.section.start=0x4000
arduino_zero_pro_bl.build.emu.mcu=atmega2560